Files/Cursos/MvvmWpfXaml.org
#+title: Wpf mvvm Xaml Course

* Recursos
- [[https://github.com/Carlos487/awesome-wpf][Awesome WPF]]
- aa

* MVVM
- Significa Model, View, ViewModel.
- En el Model tenemos las clases que modelan los datos de nuestra aplicación.
- En el View, tenemos las vistas o las pantallas (UI) de nuestra aplicación.
- En el ViewModel tenemos la lógica de la UI y conecta al Model y al ViewModel.
- Lo común es tenerlo en carpetas separadas, pero también pueden estar en proyectos separados.
- Esto nos ayuda a tener una aplicación más fácil de mantener, de extender y testear.
- Se basa en el Binding.

** Funcionamiento
- El =View=, obtiene información mediante el =DataBinding= y recibe notificaciones del =ViewModel=.
- EL =ViewModel= manda actualizaciones al =Model= y recibe notificaciones del =Model=.

** El =Model=
- Tiene el modelo de los datos.
- Contiene la lógica de negocio y de validación.
- Todo tipo de clases en general.

** La =View=
- El código de lo que se ve en la pantalla.
- =Code behind= limitado, sin lógica de negocio.
- Obtiene datos del =ViewModel= a través de =bindings= o métodos.

** El =ViewModel=
- Intermediario entre el =View= y el =Model=.
- Contiene la lógica del =View=.
- Provee datos desde el =Model= a la =View=.

** =INotifyPropertyChanged=
Es una interfaz que podemos implementar para saber cuando el valor de una propiedad ha cambiado

Cuando dos propiedades se les hizo =Binding=, ambas reciben la notificación:
- El =View= se mantiene actualizado con los valores del =Modelo= (=OneWay=).
- El =Model= se mantiene actualizado con los valores de la =View= y viceversa. (=TwoWay=)

Funciona de la siguiente manera:
1. La clase que representa el =ViewModel= implementa la interfaz =INotifyPropertyChanged=.
2. Cambios a una propiedad disparan un evento.
3. Propiedades que hicieron =Binding= a esa propiedad responden al evento actualizándose.

