Publ/Cursos/MvvmWpfXaml.html
<!doctype html>
<html lang="en">
<head>
<title>Wpf mvvm Xaml Course</title>
<!-- 2022-02-04 Fri 22:23 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="J.D Castro">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Recursos</a></li>
<li><a href="#sec-2">2. MVVM</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. Funcionamiento</a></li>
<li><a href="#sec-2-2">2.2. El <code>Model</code></a></li>
<li><a href="#sec-2-3">2.3. La <code>View</code></a></li>
<li><a href="#sec-2-4">2.4. El <code>ViewModel</code></a></li>
<li><a href="#sec-2-5">2.5. <code>INotifyPropertyChanged</code></a></li>
<li><a href="#sec-2-6">2.6. <code>ICommand</code></a></li>
<li><a href="#sec-2-7">2.7. la clase <code>ObservableCollection</code></a></li>
<li><a href="#sec-2-8">2.8. <code>IValueConverter</code></a></li>
</ul>
</li>
<li><a href="#sec-3">3. XAML</a>
<ul class="nav">
<li><a href="#sec-3-1">3.1. Definir pantalla de inicio</a></li>
<li><a href="#sec-3-2">3.2. Lanzando, abriendo y cerrando ventanas</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Estilos</a>
<ul class="nav">
<li><a href="#sec-4-1">4.1. Static Resources</a></li>
<li><a href="#sec-4-2">4.2. Estilos para toda la aplicación</a></li>
<li><a href="#sec-4-3">4.3. Estilos implícitos</a></li>
<li><a href="#sec-4-4">4.4. Estilos Explícitos</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Wpf mvvm Xaml Course</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Recursos</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="https://github.com/Carlos487/awesome-wpf">Awesome WPF</a>
</li>
<li>aa
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> MVVM</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Significa Model, View, ViewModel.
</li>
<li>En el Model tenemos las clases que modelan los datos de nuestra aplicación.
</li>
<li>En el View, tenemos las vistas o las pantallas (UI) de nuestra aplicación.
</li>
<li>En el ViewModel tenemos la lógica de la UI y conecta al Model y al ViewModel.
</li>
<li>Lo común es tenerlo en carpetas separadas, pero también pueden estar en proyectos separados.
</li>
<li>Esto nos ayuda a tener una aplicación más fácil de mantener, de extender y testear.
</li>
<li>Se basa en el Binding.
</li>
</ul>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Funcionamiento</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>El <code>View</code>, obtiene información mediante el <code>DataBinding</code> y recibe notificaciones del <code>ViewModel</code>.
</li>
<li>EL <code>ViewModel</code> manda actualizaciones al <code>Model</code> y recibe notificaciones del <code>Model</code>.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> El <code>Model</code></h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Tiene el modelo de los datos.
</li>
<li>Contiene la lógica de negocio y de validación.
</li>
<li>Todo tipo de clases en general.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> La <code>View</code></h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>El código de lo que se ve en la pantalla.
</li>
<li><code>Code behind</code> limitado, sin lógica de negocio.
</li>
<li>Obtiene datos del <code>ViewModel</code> a través de <code>bindings</code> o métodos.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> El <code>ViewModel</code></h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>Intermediario entre el <code>View</code> y el <code>Model</code>.
</li>
<li>Contiene la lógica del <code>View</code>.
</li>
<li>Provee datos desde el <code>Model</code> a la <code>View</code>.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> <code>INotifyPropertyChanged</code></h3>
<div class="outline-text-3" id="text-2-5">
<p>
Es una interfaz que podemos implementar para saber cuando el valor de una propiedad ha cambiado
</p>

<p>
Cuando dos propiedades se les hizo <code>Binding</code>, ambas reciben la notificación:
</p>
<ul class="org-ul">
<li>El <code>View</code> se mantiene actualizado con los valores del <code>Modelo</code> (<code>OneWay</code>).
</li>
<li>El <code>Model</code> se mantiene actualizado con los valores de la <code>View</code> y viceversa. (<code>TwoWay</code>)
</li>
</ul>

<p>
Funciona de la siguiente manera:
</p>
<ol class="org-ol">
<li>La clase que representa el <code>ViewModel</code> implementa la interfaz <code>INotifyPropertyChanged</code>.
</li>
<li>Cambios a una propiedad disparan un evento.
</li>
<li>Propiedades que hicieron <code>Binding</code> a esa propiedad responden al evento actualizándose.
</li>
</ol>
</div>
