Files/Cursos/MvvmWpfXaml.org
*** Ejemplo:
Hacemos que nuestra clase que va a funcionar como el =ViewModel= implemente la interfaz.
#+begin_src csharp
public class WeatherViewModel : INotifyPropertyChanged {

    // El evento que vamos a levantar cada que una propiedad cambie.
    public event PropertyChangedEventHandler? PropertyChanged;

    // El método que usaremos para lanzar el evento.
    [NotifyPropertyChangedInvocator]
    protected virtual void OnPropertyChanged([CallerMemberName] string? propertyName = null) {
        PropertyChanged?.Invoke(this, new PropertyChangedEventArgs(propertyName));
    }
}
#+end_src

Entonces podemos hacer nuestras propiedades reaccionar a los cambios.

#+begin_src csharp
public class WeatherViewModel : INotifyPropertyChanged {

    private string? _query;

    public string? Query {
        get => _query;
        set {
            _query = value;
            // el OnPropertyChanged viene de implementar la interfaz INotifyPropertyChanged
            OnPropertyChanged(nameof(Query));
        }
    }

    // El evento que vamos a levantar cada que una propiedad cambie.
    public event PropertyChangedEventHandler? PropertyChanged;

    // El método que usaremos para lanzar el evento.
    [NotifyPropertyChangedInvocator]
    protected virtual void OnPropertyChanged([CallerMemberName] string? propertyName = null) {
        PropertyChanged?.Invoke(this, new PropertyChangedEventArgs(propertyName));
    }
}
#+end_src

Una vez hecho eso podemos usar nuestra propiedad en el =View= y hacer =Binding=.
#+begin_src xml
<!-- El binding va a la propiedad llamada Query,
El modo TwoWay es para que se actualice la propiedad y el campo de texto al mismo tiempo si cambia alguno de los dos,
El Update SourceTrigger se usa para Poner en que condiciones se hace el update.  -->
<TextBox Margin="5 5"
            Text="{Binding Query,
            Mode=TwoWay,
            UpdateSourceTrigger=PropertyChanged}"/>
#+end_src

Con esto nuestra propiedad siempre se mantendrá actualizada.

