Publ/Cursos/MvvmWpfXaml.html

<div id="outline-container-sec-2-5-1" class="outline-4">
<h4 id="sec-2-5-1"><span class="section-number-4">2.5.1</span> Ejemplo:</h4>
<div class="outline-text-4" id="text-2-5-1">
<p>
Hacemos que nuestra clase que va a funcionar como el <code>ViewModel</code> implemente la interfaz.
</p>
<div class="org-src-container">

<pre class="src src-csharp"><span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ff79c6; font-style: italic;">class</span> <span style="color: #bd93f9;">WeatherViewModel</span> : <span style="color: #bd93f9;">INotifyPropertyChanged</span> <span style="color: #61bfff;">{</span>

    <span style="color: #6272a4; font-style: italic;">// </span><span style="color: #6272a4; font-style: italic;">El evento que vamos a levantar cada que una propiedad cambie.</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ff79c6; font-style: italic;">event</span> <span style="color: #bd93f9;">PropertyChangedEventHandler</span>? <span style="color: #ffc9e8;">PropertyChanged</span>;

    <span style="color: #6272a4; font-style: italic;">// </span><span style="color: #6272a4; font-style: italic;">El m&#233;todo que usaremos para lanzar el evento.</span>
    <span style="color: #ff79c6;">[</span><span style="color: #ffc9e8;">NotifyPropertyChangedInvocator</span><span style="color: #ff79c6;">]</span>
    <span style="color: #ff79c6; font-style: italic;">protected</span> <span style="color: #ff79c6; font-style: italic;">virtual</span> <span style="color: #bd93f9;">void</span> <span style="color: #50fa7b;">OnPropertyChanged</span><span style="color: #ff79c6;">(</span><span style="color: #50fa7b;">[</span><span style="color: #ffc9e8;">CallerMemberName</span><span style="color: #50fa7b;">]</span> <span style="color: #bd93f9;">string</span>? propertyName = <span style="color: #8be9fd;">null</span><span style="color: #ff79c6;">)</span> <span style="color: #ff79c6;">{</span>
        PropertyChanged?.<span style="color: #50fa7b;">Invoke</span><span style="color: #50fa7b;">(</span><span style="color: #ff79c6; font-style: italic;">this</span>, <span style="color: #ff79c6; font-style: italic;">new</span> <span style="color: #bd93f9;">PropertyChangedEventArgs</span><span style="color: #bd93f9;">(</span><span style="color: #bd93f9;">propertyName</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span>;
    <span style="color: #ff79c6;">}</span>
<span style="color: #61bfff;">}</span>
</pre>
</div>

<p>
Entonces podemos hacer nuestras propiedades reaccionar a los cambios.
</p>

<div class="org-src-container">

<pre class="src src-csharp"><span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ff79c6; font-style: italic;">class</span> <span style="color: #bd93f9;">WeatherViewModel</span> : <span style="color: #bd93f9;">INotifyPropertyChanged</span> <span style="color: #61bfff;">{</span>

    <span style="color: #ff79c6; font-style: italic;">private</span> <span style="color: #bd93f9;">string</span>? <span style="color: #ffc9e8;">_query</span>;

    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #bd93f9;">string</span>? <span style="color: #ffc9e8;">Query</span> <span style="color: #ff79c6;">{</span>
        <span style="color: #ff79c6; font-style: italic;">get</span> =&gt; _query;
        <span style="color: #ff79c6; font-style: italic;">set</span> <span style="color: #50fa7b;">{</span>
            _query = <span style="color: #8be9fd;">value</span>;
            <span style="color: #6272a4; font-style: italic;">// </span><span style="color: #6272a4; font-style: italic;">el OnPropertyChanged viene de implementar la interfaz INotifyPropertyChanged</span>
            <span style="color: #50fa7b;">OnPropertyChanged</span><span style="color: #bd93f9;">(</span><span style="color: #50fa7b;">nameof</span><span style="color: #61bfff;">(</span><span style="color: #ffc9e8;">Query</span><span style="color: #61bfff;">)</span><span style="color: #bd93f9;">)</span>;
        <span style="color: #50fa7b;">}</span>
    <span style="color: #ff79c6;">}</span>

    <span style="color: #6272a4; font-style: italic;">// </span><span style="color: #6272a4; font-style: italic;">El evento que vamos a levantar cada que una propiedad cambie.</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ff79c6; font-style: italic;">event</span> <span style="color: #bd93f9;">PropertyChangedEventHandler</span>? <span style="color: #ffc9e8;">PropertyChanged</span>;

    <span style="color: #6272a4; font-style: italic;">// </span><span style="color: #6272a4; font-style: italic;">El m&#233;todo que usaremos para lanzar el evento.</span>
    <span style="color: #ff79c6;">[</span><span style="color: #ffc9e8;">NotifyPropertyChangedInvocator</span><span style="color: #ff79c6;">]</span>
    <span style="color: #ff79c6; font-style: italic;">protected</span> <span style="color: #ff79c6; font-style: italic;">virtual</span> <span style="color: #bd93f9;">void</span> <span style="color: #50fa7b;">OnPropertyChanged</span><span style="color: #ff79c6;">(</span><span style="color: #50fa7b;">[</span><span style="color: #ffc9e8;">CallerMemberName</span><span style="color: #50fa7b;">]</span> <span style="color: #bd93f9;">string</span>? propertyName = <span style="color: #8be9fd;">null</span><span style="color: #ff79c6;">)</span> <span style="color: #ff79c6;">{</span>
        PropertyChanged?.<span style="color: #50fa7b;">Invoke</span><span style="color: #50fa7b;">(</span><span style="color: #ff79c6; font-style: italic;">this</span>, <span style="color: #ff79c6; font-style: italic;">new</span> <span style="color: #bd93f9;">PropertyChangedEventArgs</span><span style="color: #bd93f9;">(</span><span style="color: #bd93f9;">propertyName</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span>;
    <span style="color: #ff79c6;">}</span>
<span style="color: #61bfff;">}</span>
</pre>
</div>

<p>
Una vez hecho eso podemos usar nuestra propiedad en el <code>View</code> y hacer <code>Binding</code>.
</p>
<div class="org-src-container">

<pre class="src src-xml">&lt;?<span style="color: #ff79c6; font-style: italic;">xml</span> <span style="color: #8995ba; font-style: italic;">version="1.0" encoding="utf-8"</span>?&gt;
<span style="color: #6272a4; font-style: italic;">&lt;!-- </span><span style="color: #6272a4; font-style: italic;">El binding va a la propiedad llamada Query,</span>
<span style="color: #6272a4; font-style: italic;">El modo TwoWay es para que se actualice la propiedad y el campo de texto al mismo tiempo si cambia alguno de los dos,</span>
<span style="color: #6272a4; font-style: italic;">El Update SourceTrigger se usa para Poner en que condiciones se hace el update.</span><span style="color: #6272a4; font-style: italic;">  --&gt;</span>
&lt;<span style="color: #50fa7b;">TextBox</span> <span style="color: #ffc9e8;">Margin</span>=<span style="color: #f1fa8c;">"5 5"</span>
            <span style="color: #ffc9e8;">Text</span>=<span style="color: #f1fa8c;">"{Binding Query,</span>
<span style="color: #f1fa8c;">            Mode=TwoWay,</span>
<span style="color: #f1fa8c;">            UpdateSourceTrigger=PropertyChanged}"</span>/&gt;
</pre>
</div>

<p>
Con esto nuestra propiedad siempre se mantendrá actualizada.
</p>
</div>
</div>
</div>
