Files/Cursos/MvvmWpfXaml.org
** =ICommand=
Más información [[https://www.c-sharpcorner.com/UploadFile/20c06b/icommand-and-relaycommand-in-wpf/][aquí]]
Es la propiedad que usaremos para reemplazar eventos en el patrón =MVVM=.

Los comandos pueden mover algo de la lógica del =Code behind= al =ViewModel=, esto tiene ventajas:
- Limpia la capa del =View=.
- Permite reutilizarlos entre ventanas.

Existe como una propiedad para los botones.
- Lo cual lo vuelve un remplazo perfecto para =Event Handlers=.

Funciona de la siguiente manera:
1. El =ViewModel= implementa la interfaz =ICommand=.
2. La funcionalidad es agregada al método =Execute=.
3. Validaciones opcionales pueden ser agregadas en el método =CanExecute=.
4. El comando es asignado.

Podemos crear el comando en una clase afuera de nuestro =ViewModel= como en el siguiente ejemplo.

Primero deberíamos de crear el método en nuestro =ViewModel= que deseamos ejecutar con el comando
#+begin_src csharp
public async Task MakeQuery() {
    if (Query != null) {
        var cities = await AccuWeatherHelper.GetCities(Query);

        Cities.Clear();
        foreach (var city in cities)
            Cities.Add(city);
    }
}
#+end_src

Después dentro del directorio =ViewModel= Podemos crear una carpeta llamada =Commands= y allí agregar la clase en
la que implementaremos la interfaz =ICommand=.

#+begin_src csharp
public class SearchCommand : ICommand {

    // propiedad del tipo del VM.
    public WeatherViewModel WeatherVm { get; set; }

    // Constructor, obtiene la clase del VM al que pertenece.
    public SearchCommand(WeatherViewModel viewModel) {
        WeatherVm = viewModel;
    }

    // Método que verifica si se puede ejecutar el comando (opcional).
    public bool CanExecute(object? parameter) {
        var query = parameter as string;
        return !string.IsNullOrWhiteSpace(query);
    }

    // Método que ejecuta el commando dado de alta en VM.
    public async void Execute(object? parameter) {
        await WeatherVm.MakeQuery();
    }

    // se encarga de actualizar el valor que se chequea.
    public event EventHandler? CanExecuteChanged {
        // Evento que se triguerea cuando cambia el parametro que se manda al canExecute
        // Dice que hacer con el valor cuando este cambia
        add => CommandManager.RequerySuggested += value;
        remove => CommandManager.RequerySuggested -= value;
    }
}
#+end_src

Ahora podemos hacer =Binding= en el =View= para ejecutar el comando, pero antes necesitamos crear una propiedad
en el =ViewModel= para que nuestro =View= pueda verla.

#+begin_src csharp
public class WeatherViewModel : INotifyPropertyChanged {

    // ...

    // Creamos nuestra propedad con el nobre y el tipo de nuestro comando.
    public SearchCommand SearchCommand { get; set; }

    // El método que ejecutará el comando.
    public async Task MakeQuery() {
        if (Query != null) {
            var cities = await AccuWeatherHelper.GetCities(Query);

            Cities.Clear();
            foreach (var city in cities)
                Cities.Add(city);
        }
    }

    // Necesitamos Crear un constructor en nuestro ViewModel
    public WeatherViewModel() {

        // Necesitamos instanciar nuestro comando desde el constructor del ViewModel,
        // Esto porque el constructor de nuestra clase SearchCommand, tiene como parametro
        // Un objeto tipo WheatherViewModel.
        SearchCommand = new SearchCommand(this);
    }

    // ...
}
#+end_src

Ahora podemos hacer =Binding= en el =View= Libremente.

#+begin_src xml
<!-- El command se hace el binding a una propiedad del VM,
La propiedad se inicializa desde el constructor del VM,
La propiedad es una clase que implementa la interfaz ICommand,
El CommandParameter es el parámetro que se le va a mandar al commando,
Se hizo el binding a la propiedad Query del VM la cual manda una señal cuando cambia,
Y se maneja en evento CanExecuteChanged el cual viene de la interfaz ICommand -->
<Button Margin="5 5"
        Command="{Binding SearchCommand}"
        CommandParameter="{Binding Query}"
        Content="Search"/>
#+end_src

El argumento =CommandParameter= sirve para mandar un argumento opcional al comando, en caso de que sea necesario.

