Publ/Cursos/MvvmWpfXaml.html

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> <code>ICommand</code></h3>
<div class="outline-text-3" id="text-2-6">
<p>
Más información <a href="https://www.c-sharpcorner.com/UploadFile/20c06b/icommand-and-relaycommand-in-wpf/">aquí</a>
Es la propiedad que usaremos para reemplazar eventos en el patrón <code>MVVM</code>.
</p>

<p>
Los comandos pueden mover algo de la lógica del <code>Code behind</code> al <code>ViewModel</code>, esto tiene ventajas:
</p>
<ul class="org-ul">
<li>Limpia la capa del <code>View</code>.
</li>
<li>Permite reutilizarlos entre ventanas.
</li>
</ul>

<p>
Existe como una propiedad para los botones.
</p>
<ul class="org-ul">
<li>Lo cual lo vuelve un remplazo perfecto para <code>Event Handlers</code>.
</li>
</ul>

<p>
Funciona de la siguiente manera:
</p>
<ol class="org-ol">
<li>El <code>ViewModel</code> implementa la interfaz <code>ICommand</code>.
</li>
<li>La funcionalidad es agregada al método <code>Execute</code>.
</li>
<li>Validaciones opcionales pueden ser agregadas en el método <code>CanExecute</code>.
</li>
<li>El comando es asignado.
</li>
</ol>

<p>
Podemos crear el comando en una clase afuera de nuestro <code>ViewModel</code> como en el siguiente ejemplo.
</p>

<p>
Primero deberíamos de crear el método en nuestro <code>ViewModel</code> que deseamos ejecutar con el comando
</p>
<div class="org-src-container">

<pre class="src src-csharp"><span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ff79c6; font-style: italic;">async</span> <span style="color: #bd93f9;">Task</span> <span style="color: #50fa7b;">MakeQuery</span><span style="color: #61bfff;">()</span> <span style="color: #61bfff;">{</span>
    <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #ff79c6;">(</span>Query != <span style="color: #8be9fd;">null</span><span style="color: #ff79c6;">)</span> <span style="color: #ff79c6;">{</span>
        <span style="color: #bd93f9;">var</span> <span style="color: #ffc9e8;">cities</span> = <span style="color: #ff79c6; font-style: italic;">await</span> AccuWeatherHelper.<span style="color: #50fa7b;">GetCities</span><span style="color: #50fa7b;">(</span>Query<span style="color: #50fa7b;">)</span>;

        Cities.<span style="color: #50fa7b;">Clear</span><span style="color: #50fa7b;">()</span>;
        <span style="color: #ff79c6; font-style: italic;">foreach</span> <span style="color: #50fa7b;">(</span><span style="color: #bd93f9;">var</span> <span style="color: #ffc9e8;">city</span> <span style="color: #ff79c6; font-style: italic;">in</span> cities<span style="color: #50fa7b;">)</span>
            Cities.<span style="color: #50fa7b;">Add</span><span style="color: #50fa7b;">(</span>city<span style="color: #50fa7b;">)</span>;
    <span style="color: #ff79c6;">}</span>
<span style="color: #61bfff;">}</span>
</pre>
</div>

<p>
Después dentro del directorio <code>ViewModel</code> Podemos crear una carpeta llamada <code>Commands</code> y allí agregar la clase en
la que implementaremos la interfaz <code>ICommand</code>.
</p>

<div class="org-src-container">

<pre class="src src-csharp"><span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ff79c6; font-style: italic;">class</span> <span style="color: #bd93f9;">SearchCommand</span> : <span style="color: #bd93f9;">ICommand</span> <span style="color: #61bfff;">{</span>

    <span style="color: #6272a4; font-style: italic;">// </span><span style="color: #6272a4; font-style: italic;">propiedad del tipo del VM.</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #bd93f9;">WeatherViewModel</span> <span style="color: #ffc9e8;">WeatherVm</span> <span style="color: #ff79c6;">{</span> <span style="color: #ff79c6; font-style: italic;">get</span>; <span style="color: #ff79c6; font-style: italic;">set</span>; <span style="color: #ff79c6;">}</span>

    <span style="color: #6272a4; font-style: italic;">// </span><span style="color: #6272a4; font-style: italic;">Constructor, obtiene la clase del VM al que pertenece.</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #50fa7b;">SearchCommand</span><span style="color: #ff79c6;">(</span><span style="color: #bd93f9;">WeatherViewModel</span> <span style="color: #ffc9e8;">viewModel</span><span style="color: #ff79c6;">)</span> <span style="color: #ff79c6;">{</span>
        WeatherVm = viewModel;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #6272a4; font-style: italic;">// </span><span style="color: #6272a4; font-style: italic;">M&#233;todo que verifica si se puede ejecutar el comando (opcional).</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #bd93f9;">bool</span> <span style="color: #50fa7b;">CanExecute</span><span style="color: #ff79c6;">(</span><span style="color: #bd93f9;">object</span>? <span style="color: #ffc9e8;">parameter</span><span style="color: #ff79c6;">)</span> <span style="color: #ff79c6;">{</span>
        <span style="color: #bd93f9;">var</span> <span style="color: #ffc9e8;">query</span> = parameter <span style="color: #ff79c6; font-style: italic;">as</span> <span style="color: #bd93f9;">string</span>;
        <span style="color: #ff79c6; font-style: italic;">return</span> <span style="color: #bd93f9; font-weight: bold;">!</span><span style="color: #bd93f9;">string</span>.<span style="color: #50fa7b;">IsNullOrWhiteSpace</span><span style="color: #50fa7b;">(</span>query<span style="color: #50fa7b;">)</span>;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #6272a4; font-style: italic;">// </span><span style="color: #6272a4; font-style: italic;">M&#233;todo que ejecuta el commando dado de alta en VM.</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ff79c6; font-style: italic;">async</span> <span style="color: #bd93f9;">void</span> <span style="color: #50fa7b;">Execute</span><span style="color: #ff79c6;">(</span><span style="color: #bd93f9;">object</span>? <span style="color: #ffc9e8;">parameter</span><span style="color: #ff79c6;">)</span> <span style="color: #ff79c6;">{</span>
        <span style="color: #ff79c6; font-style: italic;">await</span> WeatherVm.<span style="color: #50fa7b;">MakeQuery</span><span style="color: #50fa7b;">()</span>;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #6272a4; font-style: italic;">// </span><span style="color: #6272a4; font-style: italic;">se encarga de actualizar el valor que se chequea.</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ff79c6; font-style: italic;">event</span> <span style="color: #bd93f9;">EventHandler</span>? <span style="color: #ffc9e8;">CanExecuteChanged</span> <span style="color: #ff79c6;">{</span>
        <span style="color: #6272a4; font-style: italic;">// </span><span style="color: #6272a4; font-style: italic;">Evento que se triguerea cuando cambia el parametro que se manda al canExecute</span>
        <span style="color: #6272a4; font-style: italic;">// </span><span style="color: #6272a4; font-style: italic;">Dice que hacer con el valor cuando este cambia</span>
        add =&gt; CommandManager.RequerySuggested += <span style="color: #8be9fd;">value</span>;
        remove =&gt; CommandManager.RequerySuggested -= <span style="color: #8be9fd;">value</span>;
    <span style="color: #ff79c6;">}</span>
<span style="color: #61bfff;">}</span>
</pre>
</div>

<p>
Ahora podemos hacer <code>Binding</code> en el <code>View</code> para ejecutar el comando, pero antes necesitamos crear una propiedad
en el <code>ViewModel</code> para que nuestro <code>View</code> pueda verla.
</p>

<div class="org-src-container">

<pre class="src src-csharp"><span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ff79c6; font-style: italic;">class</span> <span style="color: #bd93f9;">WeatherViewModel</span> : <span style="color: #bd93f9;">INotifyPropertyChanged</span> <span style="color: #61bfff;">{</span>

    <span style="color: #6272a4; font-style: italic;">// </span><span style="color: #6272a4; font-style: italic;">...</span>

    <span style="color: #6272a4; font-style: italic;">// </span><span style="color: #6272a4; font-style: italic;">Creamos nuestra propedad con el nobre y el tipo de nuestro comando.</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #bd93f9;">SearchCommand</span> <span style="color: #ffc9e8;">SearchCommand</span> <span style="color: #ff79c6;">{</span> <span style="color: #ff79c6; font-style: italic;">get</span>; <span style="color: #ff79c6; font-style: italic;">set</span>; <span style="color: #ff79c6;">}</span>

    <span style="color: #6272a4; font-style: italic;">// </span><span style="color: #6272a4; font-style: italic;">El m&#233;todo que ejecutar&#225; el comando.</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ff79c6; font-style: italic;">async</span> <span style="color: #bd93f9;">Task</span> <span style="color: #50fa7b;">MakeQuery</span><span style="color: #ff79c6;">()</span> <span style="color: #ff79c6;">{</span>
        <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #50fa7b;">(</span>Query != <span style="color: #8be9fd;">null</span><span style="color: #50fa7b;">)</span> <span style="color: #50fa7b;">{</span>
            <span style="color: #bd93f9;">var</span> <span style="color: #ffc9e8;">cities</span> = <span style="color: #ff79c6; font-style: italic;">await</span> AccuWeatherHelper.<span style="color: #50fa7b;">GetCities</span><span style="color: #bd93f9;">(</span>Query<span style="color: #bd93f9;">)</span>;

            Cities.<span style="color: #50fa7b;">Clear</span><span style="color: #bd93f9;">()</span>;
            <span style="color: #ff79c6; font-style: italic;">foreach</span> <span style="color: #bd93f9;">(</span><span style="color: #bd93f9;">var</span> <span style="color: #ffc9e8;">city</span> <span style="color: #ff79c6; font-style: italic;">in</span> cities<span style="color: #bd93f9;">)</span>
                Cities.<span style="color: #50fa7b;">Add</span><span style="color: #bd93f9;">(</span>city<span style="color: #bd93f9;">)</span>;
        <span style="color: #50fa7b;">}</span>
    <span style="color: #ff79c6;">}</span>

    <span style="color: #6272a4; font-style: italic;">// </span><span style="color: #6272a4; font-style: italic;">Necesitamos Crear un constructor en nuestro ViewModel</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #50fa7b;">WeatherViewModel</span><span style="color: #ff79c6;">()</span> <span style="color: #ff79c6;">{</span>

        <span style="color: #6272a4; font-style: italic;">// </span><span style="color: #6272a4; font-style: italic;">Necesitamos instanciar nuestro comando desde el constructor del ViewModel,</span>
        <span style="color: #6272a4; font-style: italic;">// </span><span style="color: #6272a4; font-style: italic;">Esto porque el constructor de nuestra clase SearchCommand, tiene como parametro</span>
        <span style="color: #6272a4; font-style: italic;">// </span><span style="color: #6272a4; font-style: italic;">Un objeto tipo WheatherViewModel.</span>
        SearchCommand = <span style="color: #ff79c6; font-style: italic;">new</span> <span style="color: #bd93f9;">SearchCommand</span><span style="color: #50fa7b;">(</span><span style="color: #ff79c6; font-style: italic;">this</span><span style="color: #50fa7b;">)</span>;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #6272a4; font-style: italic;">// </span><span style="color: #6272a4; font-style: italic;">...</span>
<span style="color: #61bfff;">}</span>
</pre>
</div>

<p>
Ahora podemos hacer <code>Binding</code> en el <code>View</code> Libremente.
</p>

<div class="org-src-container">

<pre class="src src-xml">&lt;?<span style="color: #ff79c6; font-style: italic;">xml</span> <span style="color: #8995ba; font-style: italic;">version="1.0" encoding="utf-8"</span>?&gt;
<span style="color: #6272a4; font-style: italic;">&lt;!-- </span><span style="color: #6272a4; font-style: italic;">El command se hace el binding a una propiedad del VM,</span>
<span style="color: #6272a4; font-style: italic;">La propiedad se inicializa desde el constructor del VM,</span>
<span style="color: #6272a4; font-style: italic;">La propiedad es una clase que implementa la interfaz ICommand,</span>
<span style="color: #6272a4; font-style: italic;">El CommandParameter es el par&#225;metro que se le va a mandar al commando,</span>
<span style="color: #6272a4; font-style: italic;">Se hizo el binding a la propiedad Query del VM la cual manda una se&#241;al cuando cambia,</span>
<span style="color: #6272a4; font-style: italic;">Y se maneja en evento CanExecuteChanged el cual viene de la interfaz ICommand</span><span style="color: #6272a4; font-style: italic;"> --&gt;</span>
&lt;<span style="color: #50fa7b;">Button</span> <span style="color: #ffc9e8;">Margin</span>=<span style="color: #f1fa8c;">"5 5"</span>
        <span style="color: #ffc9e8;">Command</span>=<span style="color: #f1fa8c;">"{Binding SearchCommand}"</span>
        <span style="color: #ffc9e8;">CommandParameter</span>=<span style="color: #f1fa8c;">"{Binding Query}"</span>
        <span style="color: #ffc9e8;">Content</span>=<span style="color: #f1fa8c;">"Search"</span>/&gt;
</pre>
</div>

<p>
El argumento <code>CommandParameter</code> sirve para mandar un argumento opcional al comando, en caso de que sea necesario.
</p>
</div>
</div>
