Files/Cursos/MvvmWpfXaml.org
** la clase =ObservableCollection=
Una =ObservableCollection= es una lista que esta al pendiente de cambios.

Funciona de la siguiente manera:
1. necesitamos una clase que herede de la clase =ObservableCollection<T>=.
2. Esa clase ya habrá implementado la interfaz =INotifyPropertyChanged=.
3. Se establece una =Binding Source=.
4. Se actualiza la UI.

Primero necesitamos una propiedad de tipo =ObservableCollection= en nuestro ViewModel.
#+begin_src csharp
    public ObservableCollection<City> Cities { get; set; }
#+end_src

Esta propiedad ya implementa la =INotifyPropertyChanged= así que no necesitamos nada más

Ahora debemos inicializar la lista en el constructor ya que si esta lista es inicializada otra vez, el =Binding= se pierde.
#+begin_src csharp
public WeatherViewModel() {
    SearchCommand = new SearchCommand(this);
    // Inicalizamos la ObservableCollecition
    Cities = new ObservableCollection<City>();
}
#+end_src

Siempre que queramos limpiar o rellenar la lista debemos limpiarla y rellenarla elemento por elemento o el =Binding= se
perderá.
#+begin_src csharp
public async Task MakeQuery() {
    if (Query != null) {
        var cities = await AccuWeatherHelper.GetCities(Query);

        Cities.Clear(); // Limpiamos la lista
        foreach (var city in cities) // Agregamos elemento por elemento.
            Cities.Add(city);
    }
}
#+end_src

Ahora podemos hacer =Binding= en el =View= para mostrar la lista.
#+begin_src xml
<!-- Desde la view hacemos binding a una propiedad del vm como ItemsSource,
y hacemos binding Del SelectedValue a una propiedad del vm -->
<ListView ItemsSource="{Binding Cities}"
          SelectedValue="{Binding SelectedCity}">
    <ListView.ItemTemplate>
        <DataTemplate>
            <Grid>
                <!-- Como ItemsSource fue definido en la listView, nuestro data context es ese,
                asi que podemos acceder a los elementos de ese dataContext -->
                <TextBlock Text="{Binding LocalizedName}"/>
            </Grid>
        </DataTemplate>
    </ListView.ItemTemplate>
</ListView>
#+end_src

El argumento =SelectedValue=, es otra propiedad que podemos usar si queremos saber que Valor esta siendo seleccionado de
la lista, Aquí creamos una propiedad llamada =SelectedCity= para guardar este valor.


