Publ/Cursos/MvvmWpfXaml.html

<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> la clase <code>ObservableCollection</code></h3>
<div class="outline-text-3" id="text-2-7">
<p>
Una <code>ObservableCollection</code> es una lista que esta al pendiente de cambios.
</p>

<p>
Funciona de la siguiente manera:
</p>
<ol class="org-ol">
<li>necesitamos una clase que herede de la clase <code>ObservableCollection&lt;T&gt;</code>.
</li>
<li>Esa clase ya habrá implementado la interfaz <code>INotifyPropertyChanged</code>.
</li>
<li>Se establece una <code>Binding Source</code>.
</li>
<li>Se actualiza la UI.
</li>
</ol>

<p>
Primero necesitamos una propiedad de tipo <code>ObservableCollection</code> en nuestro ViewModel.
</p>
<div class="org-src-container">

<pre class="src src-csharp">    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #bd93f9;">ObservableCollection</span><span style="color: #61bfff;">&lt;</span><span style="color: #bd93f9;">City</span><span style="color: #61bfff;">&gt;</span> <span style="color: #ffc9e8;">Cities</span> <span style="color: #61bfff;">{</span> <span style="color: #ff79c6; font-style: italic;">get</span>; <span style="color: #ff79c6; font-style: italic;">set</span>; <span style="color: #61bfff;">}</span>
</pre>
</div>

<p>
Esta propiedad ya implementa la <code>INotifyPropertyChanged</code> así que no necesitamos nada más
</p>

<p>
Ahora debemos inicializar la lista en el constructor ya que si esta lista es inicializada otra vez, el <code>Binding</code> se pierde.
</p>
<div class="org-src-container">

<pre class="src src-csharp"><span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #50fa7b;">WeatherViewModel</span><span style="color: #61bfff;">()</span> <span style="color: #61bfff;">{</span>
    SearchCommand = <span style="color: #ff79c6; font-style: italic;">new</span> <span style="color: #bd93f9;">SearchCommand</span><span style="color: #ff79c6;">(</span><span style="color: #ff79c6; font-style: italic;">this</span><span style="color: #ff79c6;">)</span>;
    <span style="color: #6272a4; font-style: italic;">// </span><span style="color: #6272a4; font-style: italic;">Inicalizamos la ObservableCollecition</span>
    Cities = <span style="color: #ff79c6; font-style: italic;">new</span> <span style="color: #bd93f9;">ObservableCollection</span><span style="color: #ff79c6;">&lt;</span><span style="color: #bd93f9;">City</span><span style="color: #ff79c6;">&gt;()</span>;
<span style="color: #61bfff;">}</span>
</pre>
</div>

<p>
Siempre que queramos limpiar o rellenar la lista debemos limpiarla y rellenarla elemento por elemento o el <code>Binding</code> se
perderá.
</p>
<div class="org-src-container">

<pre class="src src-csharp"><span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ff79c6; font-style: italic;">async</span> <span style="color: #bd93f9;">Task</span> <span style="color: #50fa7b;">MakeQuery</span><span style="color: #61bfff;">()</span> <span style="color: #61bfff;">{</span>
    <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #ff79c6;">(</span>Query != <span style="color: #8be9fd;">null</span><span style="color: #ff79c6;">)</span> <span style="color: #ff79c6;">{</span>
        <span style="color: #bd93f9;">var</span> <span style="color: #ffc9e8;">cities</span> = <span style="color: #ff79c6; font-style: italic;">await</span> AccuWeatherHelper.<span style="color: #50fa7b;">GetCities</span><span style="color: #50fa7b;">(</span>Query<span style="color: #50fa7b;">)</span>;

        Cities.<span style="color: #50fa7b;">Clear</span><span style="color: #50fa7b;">()</span>; <span style="color: #6272a4; font-style: italic;">// </span><span style="color: #6272a4; font-style: italic;">Limpiamos la lista</span>
        <span style="color: #ff79c6; font-style: italic;">foreach</span> <span style="color: #50fa7b;">(</span><span style="color: #bd93f9;">var</span> <span style="color: #ffc9e8;">city</span> <span style="color: #ff79c6; font-style: italic;">in</span> cities<span style="color: #50fa7b;">)</span> <span style="color: #6272a4; font-style: italic;">// </span><span style="color: #6272a4; font-style: italic;">Agregamos elemento por elemento.</span>
            Cities.<span style="color: #50fa7b;">Add</span><span style="color: #50fa7b;">(</span>city<span style="color: #50fa7b;">)</span>;
    <span style="color: #ff79c6;">}</span>
<span style="color: #61bfff;">}</span>
</pre>
</div>

<p>
Ahora podemos hacer <code>Binding</code> en el <code>View</code> para mostrar la lista.
</p>
<div class="org-src-container">

<pre class="src src-xml">&lt;?<span style="color: #ff79c6; font-style: italic;">xml</span> <span style="color: #8995ba; font-style: italic;">version="1.0" encoding="utf-8"</span>?&gt;
<span style="color: #6272a4; font-style: italic;">&lt;!-- </span><span style="color: #6272a4; font-style: italic;">Desde la view hacemos binding a una propiedad del vm como ItemsSource,</span>
<span style="color: #6272a4; font-style: italic;">y hacemos binding Del SelectedValue a una propiedad del vm</span><span style="color: #6272a4; font-style: italic;"> --&gt;</span>
&lt;<span style="color: #50fa7b;">ListView</span> <span style="color: #ffc9e8;">ItemsSource</span>=<span style="color: #f1fa8c;">"{Binding Cities}"</span>
          <span style="color: #ffc9e8;">SelectedValue</span>=<span style="color: #f1fa8c;">"{Binding SelectedCity}"</span>&gt;
    &lt;<span style="color: #50fa7b;">ListView.ItemTemplate</span>&gt;
        &lt;<span style="color: #50fa7b;">DataTemplate</span>&gt;
            &lt;<span style="color: #50fa7b;">Grid</span>&gt;
                <span style="color: #6272a4; font-style: italic;">&lt;!-- </span><span style="color: #6272a4; font-style: italic;">Como ItemsSource fue definido en la listView, nuestro data context es ese,</span>
<span style="color: #6272a4; font-style: italic;">                asi que podemos acceder a los elementos de ese dataContext</span><span style="color: #6272a4; font-style: italic;"> --&gt;</span>
                &lt;<span style="color: #50fa7b;">TextBlock</span> <span style="color: #ffc9e8;">Text</span>=<span style="color: #f1fa8c;">"{Binding LocalizedName}"</span>/&gt;
            &lt;/<span style="color: #50fa7b;">Grid</span>&gt;
        &lt;/<span style="color: #50fa7b;">DataTemplate</span>&gt;
    &lt;/<span style="color: #50fa7b;">ListView.ItemTemplate</span>&gt;
&lt;/<span style="color: #50fa7b;">ListView</span>&gt;
</pre>
</div>

<p>
El argumento <code>SelectedValue</code>, es otra propiedad que podemos usar si queremos saber que Valor esta siendo seleccionado de
la lista, Aquí creamos una propiedad llamada <code>SelectedCity</code> para guardar este valor.
</p>
</div>
</div>
