Files/Cursos/MvvmWpfXaml.org
** =IValueConverter=
Más información [[https://www.wpf-tutorial.com/es/39/ligado-de-datos/conversion-de-valores-con-ivalueconverter/][aquí]]

Nos permite:
- Cambiar el =Model= a lo que la =View= necesita.
- Cambiando entradas en la =View= para el =Model=.

Funciona de la siguiente manera:
1. Una clase implementa la interfaz =IValueConverter=.
2. El método =Convert= convierte el =Modelo= a la =View=.
3. El método =ConvertBack= convierte el =View= a la =Model=

Primero deberíamos crear una carpeta dentro de nuestro =ViewModel= llamada =Converters= y crear una nueva clase
que implemente la interfaz =IValueConverter=.

#+begin_src csharp
public class BoolToRainConverter : IValueConverter {

    public object Convert(object value, Type targetType, object parameter, CultureInfo culture) {
        var isRaining = (bool) value;
        if (isRaining)
            return "Currently raining";
        return "Currently not raining";
    }

    public object ConvertBack(object value, Type targetType, object parameter, CultureInfo culture) {
        var isRaining = (string) value;

        return isRaining == "Currently raining";
    }
}
#+end_src

Ahora debemos agregar nuestro convertidor a la =View=

Primero debemos agregar el =namespace= donde esta nuestro convertidor en el =View=, en este caso lo llamamos =converter=.
#+begin_src xml
<Window x:Class="WeatherApp.View.WeatherWindow"
        xmlns="http://schemas.microsoft.com/winfx/2006/xaml/presentation"
        xmlns:x="http://schemas.microsoft.com/winfx/2006/xaml"
        xmlns:mc="http://schemas.openxmlformats.org/markup-compatibility/2006"
        xmlns:d="http://schemas.microsoft.com/expression/blend/2008"
        xmlns:vm="clr-namespace:WeatherApp.ViewModel"
        xmlns:converters="clr-namespace:WeatherApp.ViewModel.ValueConverters"
        mc:Ignorable="d"
        Title="WeatherWindow" Height="600" Width="400">

      <!-- ... -->

</Window>
#+end_src

Después debemos agregar el recurso a la =View=.
#+begin_src xml
<!-- Declaramos los recursos de la ventana,
La clase WeatherViewModel y declaramos el namespace vm arriba con el namespace del vm  -->
<Window.Resources>
    <vm:WeatherViewModel x:Key="Vm"/>
    <!-- Declaramos nuestro convertidor -->
    <converters:BoolToRainConverter x:Key="BoolToRain"/>
</Window.Resources>
#+end_src

Ahora podemos Usar el convertidor donde lo necesitemos.
#+begin_src xml
<!-- Usamos un convertidor añadiendo el namespace, el recurso en window.resources
y lo llamamos como se muestra abajo. -->
<TextBlock Text="{Binding HasPrecipitation, Converter={StaticResource BoolToRain}}"
            Foreground="#f4f4f8"
            FontSize="16"
            Margin="20 0"/>
#+end_src
El convertidor tomara el =Bool= que hicimos =Binding= en =HasPrecipitation= y lo pasara por el convertidor dando un resultado.


* XAML
** Definir pantalla de inicio
Para definir que pantalla se debe de abrir al iniciar nuestra aplicación debemos de modificar nuestro =App.xaml=

#+begin_src xml
<Application x:Class="WeatherApp.App"
             xmlns="http://schemas.microsoft.com/winfx/2006/xaml/presentation"
             xmlns:x="http://schemas.microsoft.com/winfx/2006/xaml"
             xmlns:local="clr-namespace:WeatherApp"
             StartupUri="View/WeatherWindow.xaml">
    <Application.Resources>

    </Application.Resources>
</Application>
#+end_src

Tenemos que modificar el argumento =StartupUri= en el cual pondremos la ruta a nuestra pantalla.

En este caso Nuestra pantalla esta en una carpeta llamada =View= y se llama =WheatherWindow.xaml=.

