Publ/Cursos/MvvmWpfXaml.html


<div id="outline-container-sec-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="section-number-3">2.8</span> <code>IValueConverter</code></h3>
<div class="outline-text-3" id="text-2-8">
<p>
Más información <a href="https://www.wpf-tutorial.com/es/39/ligado-de-datos/conversion-de-valores-con-ivalueconverter/">aquí</a>
</p>

<p>
Nos permite:
</p>
<ul class="org-ul">
<li>Cambiar el <code>Model</code> a lo que la <code>View</code> necesita.
</li>
<li>Cambiando entradas en la <code>View</code> para el <code>Model</code>.
</li>
</ul>

<p>
Funciona de la siguiente manera:
</p>
<ol class="org-ol">
<li>Una clase implementa la interfaz <code>IValueConverter</code>.
</li>
<li>El método <code>Convert</code> convierte el <code>Modelo</code> a la <code>View</code>.
</li>
<li>El método <code>ConvertBack</code> convierte el <code>View</code> a la <code>Model</code>
</li>
</ol>

<p>
Primero deberíamos crear una carpeta dentro de nuestro <code>ViewModel</code> llamada <code>Converters</code> y crear una nueva clase
que implemente la interfaz <code>IValueConverter</code>.
</p>

<div class="org-src-container">

<pre class="src src-csharp"><span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ff79c6; font-style: italic;">class</span> <span style="color: #bd93f9;">BoolToRainConverter</span> : <span style="color: #bd93f9;">IValueConverter</span> <span style="color: #61bfff;">{</span>

    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #bd93f9;">object</span> <span style="color: #50fa7b;">Convert</span><span style="color: #ff79c6;">(</span><span style="color: #bd93f9;">object</span> <span style="color: #8be9fd;">value</span>, <span style="color: #bd93f9;">Type</span> <span style="color: #ffc9e8;">targetType</span>, <span style="color: #bd93f9;">object</span> <span style="color: #ffc9e8;">parameter</span>, <span style="color: #bd93f9;">CultureInfo</span> <span style="color: #ffc9e8;">culture</span><span style="color: #ff79c6;">)</span> <span style="color: #ff79c6;">{</span>
        <span style="color: #bd93f9;">var</span> <span style="color: #ffc9e8;">isRaining</span> = <span style="color: #50fa7b;">(</span><span style="color: #bd93f9;">bool</span><span style="color: #50fa7b;">)</span> <span style="color: #8be9fd;">value</span>;
        <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #50fa7b;">(</span>isRaining<span style="color: #50fa7b;">)</span>
            <span style="color: #ff79c6; font-style: italic;">return</span> <span style="color: #f1fa8c;">"Currently raining"</span>;
        <span style="color: #ff79c6; font-style: italic;">return</span> <span style="color: #f1fa8c;">"Currently not raining"</span>;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #bd93f9;">object</span> <span style="color: #50fa7b;">ConvertBack</span><span style="color: #ff79c6;">(</span><span style="color: #bd93f9;">object</span> <span style="color: #8be9fd;">value</span>, <span style="color: #bd93f9;">Type</span> <span style="color: #ffc9e8;">targetType</span>, <span style="color: #bd93f9;">object</span> <span style="color: #ffc9e8;">parameter</span>, <span style="color: #bd93f9;">CultureInfo</span> <span style="color: #ffc9e8;">culture</span><span style="color: #ff79c6;">)</span> <span style="color: #ff79c6;">{</span>
        <span style="color: #bd93f9;">var</span> <span style="color: #ffc9e8;">isRaining</span> = <span style="color: #50fa7b;">(</span><span style="color: #bd93f9;">string</span><span style="color: #50fa7b;">)</span> <span style="color: #8be9fd;">value</span>;

        <span style="color: #ff79c6; font-style: italic;">return</span> isRaining == <span style="color: #f1fa8c;">"Currently raining"</span>;
    <span style="color: #ff79c6;">}</span>
<span style="color: #61bfff;">}</span>
</pre>
</div>

<p>
Ahora debemos agregar nuestro convertidor a la <code>View</code>
</p>

<p>
Primero debemos agregar el <code>namespace</code> donde esta nuestro convertidor en el <code>View</code>, en este caso lo llamamos <code>converter</code>.
</p>
<div class="org-src-container">

<pre class="src src-xml">&lt;?<span style="color: #ff79c6; font-style: italic;">xml</span> <span style="color: #8995ba; font-style: italic;">version="1.0" encoding="utf-8"</span>?&gt;
&lt;<span style="color: #50fa7b;">Window</span> <span style="color: #ffb86c;">x</span>:<span style="color: #ffc9e8;">Class</span>=<span style="color: #f1fa8c;">"WeatherApp.View.WeatherWindow"</span>
        <span style="color: #ffb86c;">xmlns</span>=<span style="color: #f1fa8c;">"http://schemas.microsoft.com/winfx/2006/xaml/presentation"</span>
        <span style="color: #ffb86c;">xmlns</span>:<span style="color: #ffc9e8;">x</span>=<span style="color: #f1fa8c;">"http://schemas.microsoft.com/winfx/2006/xaml"</span>
        <span style="color: #ffb86c;">xmlns</span>:<span style="color: #ffc9e8;">mc</span>=<span style="color: #f1fa8c;">"http://schemas.openxmlformats.org/markup-compatibility/2006"</span>
        <span style="color: #ffb86c;">xmlns</span>:<span style="color: #ffc9e8;">d</span>=<span style="color: #f1fa8c;">"http://schemas.microsoft.com/expression/blend/2008"</span>
        <span style="color: #ffb86c;">xmlns</span>:<span style="color: #ffc9e8;">vm</span>=<span style="color: #f1fa8c;">"clr-namespace:WeatherApp.ViewModel"</span>
        <span style="color: #ffb86c;">xmlns</span>:<span style="color: #ffc9e8;">converters</span>=<span style="color: #f1fa8c;">"clr-namespace:WeatherApp.ViewModel.ValueConverters"</span>
        <span style="color: #ffb86c;">mc</span>:<span style="color: #ffc9e8;">Ignorable</span>=<span style="color: #f1fa8c;">"d"</span>
        <span style="color: #ffc9e8;">Title</span>=<span style="color: #f1fa8c;">"WeatherWindow"</span> <span style="color: #ffc9e8;">Height</span>=<span style="color: #f1fa8c;">"600"</span> <span style="color: #ffc9e8;">Width</span>=<span style="color: #f1fa8c;">"400"</span>&gt;

      <span style="color: #6272a4; font-style: italic;">&lt;!-- </span><span style="color: #6272a4; font-style: italic;">...</span><span style="color: #6272a4; font-style: italic;"> --&gt;</span>

&lt;/<span style="color: #50fa7b;">Window</span>&gt;
</pre>
</div>

<p>
Después debemos agregar el recurso a la <code>View</code>.
</p>
<div class="org-src-container">

<pre class="src src-xml">&lt;?<span style="color: #ff79c6; font-style: italic;">xml</span> <span style="color: #8995ba; font-style: italic;">version="1.0" encoding="utf-8"</span>?&gt;
<span style="color: #6272a4; font-style: italic;">&lt;!-- </span><span style="color: #6272a4; font-style: italic;">Declaramos los recursos de la ventana,</span>
<span style="color: #6272a4; font-style: italic;">La clase WeatherViewModel y declaramos el namespace vm arriba con el namespace del vm</span><span style="color: #6272a4; font-style: italic;">  --&gt;</span>
&lt;<span style="color: #50fa7b;">Window.Resources</span>&gt;
    &lt;<span style="color: #ffb86c;">vm</span>:<span style="color: #50fa7b;">WeatherViewModel</span> <span style="color: #ffb86c;">x</span>:<span style="color: #ffc9e8;">Key</span>=<span style="color: #f1fa8c;">"Vm"</span>/&gt;
    <span style="color: #6272a4; font-style: italic;">&lt;!-- </span><span style="color: #6272a4; font-style: italic;">Declaramos nuestro convertidor</span><span style="color: #6272a4; font-style: italic;"> --&gt;</span>
    &lt;<span style="color: #ffb86c;">converters</span>:<span style="color: #50fa7b;">BoolToRainConverter</span> <span style="color: #ffb86c;">x</span>:<span style="color: #ffc9e8;">Key</span>=<span style="color: #f1fa8c;">"BoolToRain"</span>/&gt;
&lt;/<span style="color: #50fa7b;">Window.Resources</span>&gt;
</pre>
</div>

<p>
Ahora podemos Usar el convertidor donde lo necesitemos.
</p>
<div class="org-src-container">

<pre class="src src-xml">&lt;?<span style="color: #ff79c6; font-style: italic;">xml</span> <span style="color: #8995ba; font-style: italic;">version="1.0" encoding="utf-8"</span>?&gt;
<span style="color: #6272a4; font-style: italic;">&lt;!-- </span><span style="color: #6272a4; font-style: italic;">Usamos un convertidor a&#241;adiendo el namespace, el recurso en window.resources</span>
<span style="color: #6272a4; font-style: italic;">y lo llamamos como se muestra abajo.</span><span style="color: #6272a4; font-style: italic;"> --&gt;</span>
&lt;<span style="color: #50fa7b;">TextBlock</span> <span style="color: #ffc9e8;">Text</span>=<span style="color: #f1fa8c;">"{Binding HasPrecipitation, Converter={StaticResource BoolToRain}}"</span>
            <span style="color: #ffc9e8;">Foreground</span>=<span style="color: #f1fa8c;">"#f4f4f8"</span>
            <span style="color: #ffc9e8;">FontSize</span>=<span style="color: #f1fa8c;">"16"</span>
            <span style="color: #ffc9e8;">Margin</span>=<span style="color: #f1fa8c;">"20 0"</span>/&gt;
</pre>
</div>
<p>
El convertidor tomara el <code>Bool</code> que hicimos <code>Binding</code> en <code>HasPrecipitation</code> y lo pasara por el convertidor dando un resultado.
</p>
</div>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> XAML</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Definir pantalla de inicio</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Para definir que pantalla se debe de abrir al iniciar nuestra aplicación debemos de modificar nuestro <code>App.xaml</code>
</p>

<div class="org-src-container">

<pre class="src src-xml">&lt;?<span style="color: #ff79c6; font-style: italic;">xml</span> <span style="color: #8995ba; font-style: italic;">version="1.0" encoding="utf-8"</span>?&gt;
&lt;<span style="color: #50fa7b;">Application</span> <span style="color: #ffb86c;">x</span>:<span style="color: #ffc9e8;">Class</span>=<span style="color: #f1fa8c;">"WeatherApp.App"</span>
             <span style="color: #ffb86c;">xmlns</span>=<span style="color: #f1fa8c;">"http://schemas.microsoft.com/winfx/2006/xaml/presentation"</span>
             <span style="color: #ffb86c;">xmlns</span>:<span style="color: #ffc9e8;">x</span>=<span style="color: #f1fa8c;">"http://schemas.microsoft.com/winfx/2006/xaml"</span>
             <span style="color: #ffb86c;">xmlns</span>:<span style="color: #ffc9e8;">local</span>=<span style="color: #f1fa8c;">"clr-namespace:WeatherApp"</span>
             <span style="color: #ffc9e8;">StartupUri</span>=<span style="color: #f1fa8c;">"View/WeatherWindow.xaml"</span>&gt;
    &lt;<span style="color: #50fa7b;">Application.Resources</span>&gt;

    &lt;/<span style="color: #50fa7b;">Application.Resources</span>&gt;
&lt;/<span style="color: #50fa7b;">Application</span>&gt;
</pre>
</div>

<p>
Tenemos que modificar el argumento <code>StartupUri</code> en el cual pondremos la ruta a nuestra pantalla.
</p>

<p>
En este caso Nuestra pantalla esta en una carpeta llamada <code>View</code> y se llama <code>WheatherWindow.xaml</code>.
</p>
</div>
</div>
