Files/Cursos/MvvmWpfXaml.org
** Lanzando, abriendo y cerrando ventanas
Para abrir una nueva ventana tenemos que instanciar una nueva instancia de la nueva ventana

#+begin_src csharp
var newContactWindow = new NewContact();
newContactWindow.ShowDialog();
#+end_src

Si usamos el método =ShowDialog= la nueva ventana bloqueara la ventana anterior, por el contrario si usamos
el método =Show= abrirá la nueva pestaña y podremos hacer cosas en la nueva pestaña y en la anterior.

* Estilos
- Podemos estilizar cada componente de nuestra aplicación, pero lo ideal es usar recursos estáticos (static resources).
- Esto para poder tener estilos empaquetados y poderlos modificar y reutilizar en diferentes partes de nuestra aplicación.

** Static Resources
- Podemos definir los recursos que va a utilizar nuestra pantalla actual declarando

#+begin_src xml
<window.Resources>
  <!-- Recursos -->
</Window.Resources>
#+end_src

Por ejemplo podemos declarar un =solidColorBrush= dentro de nuestros recursos estáticos.

#+begin_src xml
<window.Resources>
  <SolidColorBrush x:key="numbersColor" Color="#444444"/>
  <SolidColorBrush x:key="operatorsColor" Color="Orange"/>
</Window.Resources>
#+end_src

Y podemos llamarlos de la siguiente manera>

#+begin_src xml
<Button Content="+/-"
        Background="{StaticResource numbersColor}"
        x:Name="SignButton"
        Grid.Row="1"
        Grid.Column="1"/>
#+end_src

Esto puede aplicar para cualquier tipo de recurso estático, no solo Estilos.

** Estilos para toda la aplicación
- Para tener estilos en toda la aplicación debemos de definirlos en el archivo =App.xaml=.

El =App.xaml= debería lucir así por defecto.
#+begin_src xml
<Application x:Class="Calculadora.App"
             xmlns="http://schemas.microsoft.com/winfx/2006/xaml/presentation"
             xmlns:x="http://schemas.microsoft.com/winfx/2006/xaml"
             xmlns:local="clr-namespace:Calculadora"
             StartupUri="MainWindow.xaml">
    <Application.Resources>

    </Application.Resources>
</Application>
#+end_src

Entonces podríamos tener nuestro archivo así para tener los mismos estilos.

#+begin_src xml
<Application x:Class="Calculadora.App"
             xmlns="http://schemas.microsoft.com/winfx/2006/xaml/presentation"
             xmlns:x="http://schemas.microsoft.com/winfx/2006/xaml"
             xmlns:local="clr-namespace:Calculadora"
             StartupUri="MainWindow.xaml">
    <Application.Resources>
          <!-- Con los estilos que teniamos antes -->
         <SolidColorBrush x:Key="numbersColors"
                         Color="#444444"/>

        <SolidColorBrush x:Key="operatorsColor"
                         Color="Orange"/>

        <SolidColorBrush x:Key="foregroundColor"
                         Color="White"/>

    </Application.Resources>
</Application>
#+end_src

** Estilos implícitos
Podemos definir estilos que se aplican a cierto tipo de elementos

Dentro de nuestra etiqueta =Application.Resources= en =App.xaml= podemos
#+begin_src xml
<!-- Este estilo se aplicara a los Botones -->
<Style TargetType="Button">
    <!-- Cada setter es para una propiedad -->
    <Setter Property="Foreground" Value="White"/>
    <Setter Property="FontSize" Value="25"/>
    <Setter Property="Margin" Value="5"/>
</Style>
#+end_src

También podemos sobrescribir este estilo en el elemento que deseemos.

