Publ/Cursos/MvvmWpfXaml.html

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Lanzando, abriendo y cerrando ventanas</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Para abrir una nueva ventana tenemos que instanciar una nueva instancia de la nueva ventana
</p>

<div class="org-src-container">

<pre class="src src-csharp"><span style="color: #bd93f9;">var</span> <span style="color: #ffc9e8;">newContactWindow</span> = <span style="color: #ff79c6; font-style: italic;">new</span> <span style="color: #bd93f9;">NewContact</span><span style="color: #61bfff;">()</span>;
newContactWindow.<span style="color: #50fa7b;">ShowDialog</span><span style="color: #61bfff;">()</span>;
</pre>
</div>

<p>
Si usamos el método <code>ShowDialog</code> la nueva ventana bloqueara la ventana anterior, por el contrario si usamos
el método <code>Show</code> abrirá la nueva pestaña y podremos hacer cosas en la nueva pestaña y en la anterior.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Estilos</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Podemos estilizar cada componente de nuestra aplicación, pero lo ideal es usar recursos estáticos (static resources).
</li>
<li>Esto para poder tener estilos empaquetados y poderlos modificar y reutilizar en diferentes partes de nuestra aplicación.
</li>
</ul>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Static Resources</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Podemos definir los recursos que va a utilizar nuestra pantalla actual declarando
</li>
</ul>

<div class="org-src-container">

<pre class="src src-xml">&lt;?<span style="color: #ff79c6; font-style: italic;">xml</span> <span style="color: #8995ba; font-style: italic;">version="1.0" encoding="utf-8"</span>?&gt;
&lt;<span style="color: #50fa7b;">window.Resources</span>&gt;
  <span style="color: #6272a4; font-style: italic;">&lt;!-- </span><span style="color: #6272a4; font-style: italic;">Recursos</span><span style="color: #6272a4; font-style: italic;"> --&gt;</span>
&lt;/<span style="color: #50fa7b;">Window.Resources</span>&gt;
</pre>
</div>

<p>
Por ejemplo podemos declarar un <code>solidColorBrush</code> dentro de nuestros recursos estáticos.
</p>

<div class="org-src-container">

<pre class="src src-xml">&lt;?<span style="color: #ff79c6; font-style: italic;">xml</span> <span style="color: #8995ba; font-style: italic;">version="1.0" encoding="utf-8"</span>?&gt;
&lt;<span style="color: #50fa7b;">window.Resources</span>&gt;
  &lt;<span style="color: #50fa7b;">SolidColorBrush</span> <span style="color: #ffb86c;">x</span>:<span style="color: #ffc9e8;">key</span>=<span style="color: #f1fa8c;">"numbersColor"</span> <span style="color: #ffc9e8;">Color</span>=<span style="color: #f1fa8c;">"#444444"</span>/&gt;
  &lt;<span style="color: #50fa7b;">SolidColorBrush</span> <span style="color: #ffb86c;">x</span>:<span style="color: #ffc9e8;">key</span>=<span style="color: #f1fa8c;">"operatorsColor"</span> <span style="color: #ffc9e8;">Color</span>=<span style="color: #f1fa8c;">"Orange"</span>/&gt;
&lt;/<span style="color: #50fa7b;">Window.Resources</span>&gt;
</pre>
</div>

<p>
Y podemos llamarlos de la siguiente manera&gt;
</p>

<div class="org-src-container">

<pre class="src src-xml">&lt;?<span style="color: #ff79c6; font-style: italic;">xml</span> <span style="color: #8995ba; font-style: italic;">version="1.0" encoding="utf-8"</span>?&gt;
&lt;<span style="color: #50fa7b;">Button</span> <span style="color: #ffc9e8;">Content</span>=<span style="color: #f1fa8c;">"+/-"</span>
        <span style="color: #ffc9e8;">Background</span>=<span style="color: #f1fa8c;">"{StaticResource numbersColor}"</span>
        <span style="color: #ffb86c;">x</span>:<span style="color: #ffc9e8;">Name</span>=<span style="color: #f1fa8c;">"SignButton"</span>
        <span style="color: #ffc9e8;">Grid.Row</span>=<span style="color: #f1fa8c;">"1"</span>
        <span style="color: #ffc9e8;">Grid.Column</span>=<span style="color: #f1fa8c;">"1"</span>/&gt;
</pre>
</div>

<p>
Esto puede aplicar para cualquier tipo de recurso estático, no solo Estilos.
</p>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Estilos para toda la aplicación</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>Para tener estilos en toda la aplicación debemos de definirlos en el archivo <code>App.xaml</code>.
</li>
</ul>

<p>
El <code>App.xaml</code> debería lucir así por defecto.
</p>
<div class="org-src-container">

<pre class="src src-xml">&lt;?<span style="color: #ff79c6; font-style: italic;">xml</span> <span style="color: #8995ba; font-style: italic;">version="1.0" encoding="utf-8"</span>?&gt;
&lt;<span style="color: #50fa7b;">Application</span> <span style="color: #ffb86c;">x</span>:<span style="color: #ffc9e8;">Class</span>=<span style="color: #f1fa8c;">"Calculadora.App"</span>
             <span style="color: #ffb86c;">xmlns</span>=<span style="color: #f1fa8c;">"http://schemas.microsoft.com/winfx/2006/xaml/presentation"</span>
             <span style="color: #ffb86c;">xmlns</span>:<span style="color: #ffc9e8;">x</span>=<span style="color: #f1fa8c;">"http://schemas.microsoft.com/winfx/2006/xaml"</span>
             <span style="color: #ffb86c;">xmlns</span>:<span style="color: #ffc9e8;">local</span>=<span style="color: #f1fa8c;">"clr-namespace:Calculadora"</span>
             <span style="color: #ffc9e8;">StartupUri</span>=<span style="color: #f1fa8c;">"MainWindow.xaml"</span>&gt;
    &lt;<span style="color: #50fa7b;">Application.Resources</span>&gt;

    &lt;/<span style="color: #50fa7b;">Application.Resources</span>&gt;
&lt;/<span style="color: #50fa7b;">Application</span>&gt;
</pre>
</div>

<p>
Entonces podríamos tener nuestro archivo así para tener los mismos estilos.
</p>

<div class="org-src-container">

<pre class="src src-xml">&lt;?<span style="color: #ff79c6; font-style: italic;">xml</span> <span style="color: #8995ba; font-style: italic;">version="1.0" encoding="utf-8"</span>?&gt;
&lt;<span style="color: #50fa7b;">Application</span> <span style="color: #ffb86c;">x</span>:<span style="color: #ffc9e8;">Class</span>=<span style="color: #f1fa8c;">"Calculadora.App"</span>
             <span style="color: #ffb86c;">xmlns</span>=<span style="color: #f1fa8c;">"http://schemas.microsoft.com/winfx/2006/xaml/presentation"</span>
             <span style="color: #ffb86c;">xmlns</span>:<span style="color: #ffc9e8;">x</span>=<span style="color: #f1fa8c;">"http://schemas.microsoft.com/winfx/2006/xaml"</span>
             <span style="color: #ffb86c;">xmlns</span>:<span style="color: #ffc9e8;">local</span>=<span style="color: #f1fa8c;">"clr-namespace:Calculadora"</span>
             <span style="color: #ffc9e8;">StartupUri</span>=<span style="color: #f1fa8c;">"MainWindow.xaml"</span>&gt;
    &lt;<span style="color: #50fa7b;">Application.Resources</span>&gt;
          <span style="color: #6272a4; font-style: italic;">&lt;!-- </span><span style="color: #6272a4; font-style: italic;">Con los estilos que teniamos antes</span><span style="color: #6272a4; font-style: italic;"> --&gt;</span>
         &lt;<span style="color: #50fa7b;">SolidColorBrush</span> <span style="color: #ffb86c;">x</span>:<span style="color: #ffc9e8;">Key</span>=<span style="color: #f1fa8c;">"numbersColors"</span>
                         <span style="color: #ffc9e8;">Color</span>=<span style="color: #f1fa8c;">"#444444"</span>/&gt;

        &lt;<span style="color: #50fa7b;">SolidColorBrush</span> <span style="color: #ffb86c;">x</span>:<span style="color: #ffc9e8;">Key</span>=<span style="color: #f1fa8c;">"operatorsColor"</span>
                         <span style="color: #ffc9e8;">Color</span>=<span style="color: #f1fa8c;">"Orange"</span>/&gt;

        &lt;<span style="color: #50fa7b;">SolidColorBrush</span> <span style="color: #ffb86c;">x</span>:<span style="color: #ffc9e8;">Key</span>=<span style="color: #f1fa8c;">"foregroundColor"</span>
                         <span style="color: #ffc9e8;">Color</span>=<span style="color: #f1fa8c;">"White"</span>/&gt;

    &lt;/<span style="color: #50fa7b;">Application.Resources</span>&gt;
&lt;/<span style="color: #50fa7b;">Application</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Estilos implícitos</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Podemos definir estilos que se aplican a cierto tipo de elementos
</p>

<p>
Dentro de nuestra etiqueta <code>Application.Resources</code> en <code>App.xaml</code> podemos
</p>
<div class="org-src-container">

<pre class="src src-xml">&lt;?<span style="color: #ff79c6; font-style: italic;">xml</span> <span style="color: #8995ba; font-style: italic;">version="1.0" encoding="utf-8"</span>?&gt;
<span style="color: #6272a4; font-style: italic;">&lt;!-- </span><span style="color: #6272a4; font-style: italic;">Este estilo se aplicara a los Botones</span><span style="color: #6272a4; font-style: italic;"> --&gt;</span>
&lt;<span style="color: #50fa7b;">Style</span> <span style="color: #ffc9e8;">TargetType</span>=<span style="color: #f1fa8c;">"Button"</span>&gt;
    <span style="color: #6272a4; font-style: italic;">&lt;!-- </span><span style="color: #6272a4; font-style: italic;">Cada setter es para una propiedad</span><span style="color: #6272a4; font-style: italic;"> --&gt;</span>
    &lt;<span style="color: #50fa7b;">Setter</span> <span style="color: #ffc9e8;">Property</span>=<span style="color: #f1fa8c;">"Foreground"</span> <span style="color: #ffc9e8;">Value</span>=<span style="color: #f1fa8c;">"White"</span>/&gt;
    &lt;<span style="color: #50fa7b;">Setter</span> <span style="color: #ffc9e8;">Property</span>=<span style="color: #f1fa8c;">"FontSize"</span> <span style="color: #ffc9e8;">Value</span>=<span style="color: #f1fa8c;">"25"</span>/&gt;
    &lt;<span style="color: #50fa7b;">Setter</span> <span style="color: #ffc9e8;">Property</span>=<span style="color: #f1fa8c;">"Margin"</span> <span style="color: #ffc9e8;">Value</span>=<span style="color: #f1fa8c;">"5"</span>/&gt;
&lt;/<span style="color: #50fa7b;">Style</span>&gt;
</pre>
</div>

<p>
También podemos sobrescribir este estilo en el elemento que deseemos.
</p>
</div>
</div>
