Files/Cursos/MvvmWpfXaml.org
** Estilos Explícitos
Podemos definir estilos que son llamados por su nombre y solo se aplican si lo decimos explicitamente

#+begin_src xml
<!-- Este estilo se aplicara a los Botones y se llama con el nombre de numberButtonStyle -->
<!-- La diferencia es que declaramos una key con el parametro x:Key=""  -->
<Style TargetType="Button" x:Key="numberButtonStyle">
    <Setter Property="Foreground" Value="White"/>
    <Setter Property="FontSize" Value="25"/>
    <Setter Property="Margin" Value="5"/>
    <Setter Property="Background" Value="{StaticResource numbersColors}"/>
</Style>
#+end_src

Ahora podemos usar este estilo donde queramos haciendo uso de argumento =Style=.

#+begin_src xml
<!-- Declaramos que es un Recurso estatico y ponemos la key del estilo -->
<Button Content="8"
        Style="{StaticResource numberButtonStyle}"
        x:Name="EightButton"
        Click="NumberButton_Click"
        Grid.Row="2"
        Grid.Column="1"/>
#+end_src

Otra cosa que podemos hacer es basar unos estilos en otros.
#+begin_src xml
<!-- Usamos el argumento BasedOn y linkeamos el Recurso estatico asi heredamos los compomentes del estilo deseado -->
<Style TargetType="Button" x:Key="operatorButtonStyle" BasedOn="{StaticResource numberButtonStyle}">
    <Setter Property="Background" Value="{StaticResource operatorsColor}"/>
</Style>
#+end_src
