Publ/Cursos/MvvmWpfXaml.html

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Estilos Explícitos</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Podemos definir estilos que son llamados por su nombre y solo se aplican si lo decimos explicitamente
</p>

<div class="org-src-container">

<pre class="src src-xml">&lt;?<span style="color: #ff79c6; font-style: italic;">xml</span> <span style="color: #8995ba; font-style: italic;">version="1.0" encoding="utf-8"</span>?&gt;
<span style="color: #6272a4; font-style: italic;">&lt;!-- </span><span style="color: #6272a4; font-style: italic;">Este estilo se aplicara a los Botones y se llama con el nombre de numberButtonStyle</span><span style="color: #6272a4; font-style: italic;"> --&gt;</span>
<span style="color: #6272a4; font-style: italic;">&lt;!-- </span><span style="color: #6272a4; font-style: italic;">La diferencia es que declaramos una key con el parametro x:Key=""</span><span style="color: #6272a4; font-style: italic;">  --&gt;</span>
&lt;<span style="color: #50fa7b;">Style</span> <span style="color: #ffc9e8;">TargetType</span>=<span style="color: #f1fa8c;">"Button"</span> <span style="color: #ffb86c;">x</span>:<span style="color: #ffc9e8;">Key</span>=<span style="color: #f1fa8c;">"numberButtonStyle"</span>&gt;
    &lt;<span style="color: #50fa7b;">Setter</span> <span style="color: #ffc9e8;">Property</span>=<span style="color: #f1fa8c;">"Foreground"</span> <span style="color: #ffc9e8;">Value</span>=<span style="color: #f1fa8c;">"White"</span>/&gt;
    &lt;<span style="color: #50fa7b;">Setter</span> <span style="color: #ffc9e8;">Property</span>=<span style="color: #f1fa8c;">"FontSize"</span> <span style="color: #ffc9e8;">Value</span>=<span style="color: #f1fa8c;">"25"</span>/&gt;
    &lt;<span style="color: #50fa7b;">Setter</span> <span style="color: #ffc9e8;">Property</span>=<span style="color: #f1fa8c;">"Margin"</span> <span style="color: #ffc9e8;">Value</span>=<span style="color: #f1fa8c;">"5"</span>/&gt;
    &lt;<span style="color: #50fa7b;">Setter</span> <span style="color: #ffc9e8;">Property</span>=<span style="color: #f1fa8c;">"Background"</span> <span style="color: #ffc9e8;">Value</span>=<span style="color: #f1fa8c;">"{StaticResource numbersColors}"</span>/&gt;
&lt;/<span style="color: #50fa7b;">Style</span>&gt;
</pre>
</div>

<p>
Ahora podemos usar este estilo donde queramos haciendo uso de argumento <code>Style</code>.
</p>

<div class="org-src-container">

<pre class="src src-xml">&lt;?<span style="color: #ff79c6; font-style: italic;">xml</span> <span style="color: #8995ba; font-style: italic;">version="1.0" encoding="utf-8"</span>?&gt;
<span style="color: #6272a4; font-style: italic;">&lt;!-- </span><span style="color: #6272a4; font-style: italic;">Declaramos que es un Recurso estatico y ponemos la key del estilo</span><span style="color: #6272a4; font-style: italic;"> --&gt;</span>
&lt;<span style="color: #50fa7b;">Button</span> <span style="color: #ffc9e8;">Content</span>=<span style="color: #f1fa8c;">"8"</span>
        <span style="color: #ffc9e8;">Style</span>=<span style="color: #f1fa8c;">"{StaticResource numberButtonStyle}"</span>
        <span style="color: #ffb86c;">x</span>:<span style="color: #ffc9e8;">Name</span>=<span style="color: #f1fa8c;">"EightButton"</span>
        <span style="color: #ffc9e8;">Click</span>=<span style="color: #f1fa8c;">"NumberButton_Click"</span>
        <span style="color: #ffc9e8;">Grid.Row</span>=<span style="color: #f1fa8c;">"2"</span>
        <span style="color: #ffc9e8;">Grid.Column</span>=<span style="color: #f1fa8c;">"1"</span>/&gt;
</pre>
</div>

<p>
Otra cosa que podemos hacer es basar unos estilos en otros.
</p>
<div class="org-src-container">

<pre class="src src-xml">&lt;?<span style="color: #ff79c6; font-style: italic;">xml</span> <span style="color: #8995ba; font-style: italic;">version="1.0" encoding="utf-8"</span>?&gt;
<span style="color: #6272a4; font-style: italic;">&lt;!-- </span><span style="color: #6272a4; font-style: italic;">Usamos el argumento BasedOn y linkeamos el Recurso estatico asi heredamos los compomentes del estilo deseado</span><span style="color: #6272a4; font-style: italic;"> --&gt;</span>
&lt;<span style="color: #50fa7b;">Style</span> <span style="color: #ffc9e8;">TargetType</span>=<span style="color: #f1fa8c;">"Button"</span> <span style="color: #ffb86c;">x</span>:<span style="color: #ffc9e8;">Key</span>=<span style="color: #f1fa8c;">"operatorButtonStyle"</span> <span style="color: #ffc9e8;">BasedOn</span>=<span style="color: #f1fa8c;">"{StaticResource numberButtonStyle}"</span>&gt;
    &lt;<span style="color: #50fa7b;">Setter</span> <span style="color: #ffc9e8;">Property</span>=<span style="color: #f1fa8c;">"Background"</span> <span style="color: #ffc9e8;">Value</span>=<span style="color: #f1fa8c;">"{StaticResource operatorsColor}"</span>/&gt;
&lt;/<span style="color: #50fa7b;">Style</span>&gt;
</pre>
</div>
</div>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: J.D Castro</p>
<p class="date">Created: 2022-02-04 Fri 22:23</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 28.0.91 (<a href="http://orgmode.org">Org-mode</a> 9.6)</p>
</div>
</footer>
</body>
</html>
